{"keras_version": "1.2.1", "config": [{"config": {"W_constraint": null, "trainable": true, "dim_ordering": "tf", "nb_filter": 32, "bias": true, "W_regularizer": null, "subsample": [1, 1], "name": "convolution2d_5", "init": "glorot_uniform", "batch_input_shape": [null, 32, 32, 3], "b_constraint": null, "border_mode": "valid", "nb_col": 3, "activation": "linear", "input_dtype": "float32", "b_regularizer": null, "activity_regularizer": null, "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_17", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "border_mode": "valid", "pool_size": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_4", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"W_constraint": null, "trainable": true, "W_regularizer": null, "dim_ordering": "tf", "nb_filter": 64, "b_constraint": null, "subsample": [1, 1], "name": "convolution2d_6", "init": "glorot_uniform", "bias": true, "border_mode": "valid", "nb_col": 3, "activation": "linear", "b_regularizer": null, "activity_regularizer": null, "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_18", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "border_mode": "valid", "pool_size": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_5", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_7"}, "class_name": "Flatten"}, {"config": {"W_constraint": null, "trainable": true, "output_dim": 128, "input_dim": 2304, "W_regularizer": null, "name": "dense_13", "init": "glorot_uniform", "bias": true, "b_constraint": null, "activation": "linear", "b_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_19", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_3", "p": 0.5}, "class_name": "Dropout"}, {"config": {"W_constraint": null, "trainable": true, "output_dim": 128, "input_dim": 128, "W_regularizer": null, "name": "dense_14", "init": "glorot_uniform", "bias": true, "b_constraint": null, "activation": "linear", "b_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_20", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_4", "p": 0.5}, "class_name": "Dropout"}, {"config": {"W_constraint": null, "trainable": true, "output_dim": 43, "input_dim": 128, "W_regularizer": null, "name": "dense_15", "init": "glorot_uniform", "bias": true, "b_constraint": null, "activation": "linear", "b_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_21", "activation": "softmax"}, "class_name": "Activation"}], "class_name": "Sequential"}